In [1]:
%load_ext sql

%sql postgresql://ahmad:passw0rd@localhost:5432/northwind
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
from IPython.core.display import display, HTML

display(HTML("<style>.dataframe {width: 100%;}</style>"))

/tmp/ipykernel_6182/2583356205.py:1: DeprecationWarning: Importing display from IPython.core.display is deprecated since IPython 7.14, please import from IPython.display
  from IPython.core.display import display, HTML

# inventory_status_summary

In [3]:
%%sql

SELECT
    CASE 
        WHEN units_in_stock < reorder_level THEN 'Below Reorder Level'
        WHEN units_in_stock = reorder_level THEN 'At Reorder Level'
        ELSE 'Above Reorder Level'
    END AS inventory_status,
    COUNT(*) AS product_count
FROM
    "northwind"."dwh_facts"."fact_inventory"
GROUP BY
    inventory_status
ORDER BY
    product_count DESC

 * postgresql://ahmad:***@localhost:5432/northwind
3 rows affected.

[('Above Reorder Level', 55),
 ('Below Reorder Level', 18),
 ('At Reorder Level', 4)]

# monthly_products_rank

In [4]:

%%sql

WITH orders AS (
    SELECT
        order_date,
        unit_price,
        quantity,
        discount,
        CASE 
            WHEN discount = 0 THEN unit_price * quantity
            ELSE unit_price * quantity * discount
        END AS total
    FROM
        "northwind"."dwh_facts"."fact_orders"
    WHERE shipped_date IS NOT NULL
)
,
transformed AS (
    SELECT
        EXTRACT(MONTH FROM order_date) as month,
        EXTRACT(YEAR FROM order_date) as year,
        ROUND(SUM(total), 2) as total
    FROM
        orders
    GROUP BY
        EXTRACT(MONTH FROM order_date)
        , EXTRACT(YEAR FROM order_date)
    ORDER BY
        EXTRACT(YEAR FROM order_date)
		, EXTRACT(MONTH FROM order_date)
)
SELECT * FROM transformed

 * postgresql://ahmad:***@localhost:5432/northwind
23 rows affected.

[(Decimal('7'), Decimal('1996'), Decimal('17270.21')),
 (Decimal('8'), Decimal('1996'), Decimal('20208.43')),
 (Decimal('9'), Decimal('1996'), Decimal('15793.60')),
 (Decimal('10'), Decimal('1996'), Decimal('16143.84')),
 (Decimal('11'), Decimal('1996'), Decimal('23535.26')),
 (Decimal('12'), Decimal('1996'), Decimal('26235.19')),
 (Decimal('1'), Decimal('1997'), Decimal('39813.71')),
 (Decimal('2'), Decimal('1997'), Decimal('24029.57')),
 (Decimal('3'), Decimal('1997'), Decimal('30631.38')),
 (Decimal('4'), Decimal('1997'), Decimal('36497.03')),
 (Decimal('5'), Decimal('1997'), Decimal('35214.61')),
 (Decimal('6'), Decimal('1997'), Decimal('21151.90')),
 (Decimal('7'), Decimal('1997'), Decimal('30820.65')),
 (Decimal('8'), Decimal('1997'), Decimal('33617.66')),
 (Decimal('9'), Decimal('1997'), Decimal('32550.27')),
 (Decimal('10'), Decimal('1997'), Decimal('48876.15')),
 (Decimal('11'), Decimal('1997'), Decimal('31522.65')),
 (Decimal('12'), Decimal('1997'), Decimal('42171.25')),
 (Decimal('1'), Decimal('1998'), Decimal('58844.62')),
 (Decimal('2'), Decimal('1998'), Decimal('49402.17')),
 (Decimal('3'), Decimal('1998'), Decimal('82515.63')),
 (Decimal('4'), Decimal('1998'), Decimal('84378.41')),
 (Decimal('5'), Decimal('1998'), Decimal('9843.88'))]

# monthly_sales_summary

In [5]:
%%sql

WITH orders AS (
    SELECT
        order_date,
        unit_price,
        quantity,
        discount,
        (unit_price * quantity * discount) AS total
    FROM
        "northwind"."dwh_facts"."fact_orders"
    WHERE shipped_date IS NOT NULL
)
,
transformed AS (
    SELECT
        EXTRACT(MONTH FROM order_date) as month,
        EXTRACT(YEAR FROM order_date) as year,
        ROUND(SUM(total), 2) as total
    FROM
        orders
    GROUP BY
        EXTRACT(MONTH FROM order_date)
        , EXTRACT(YEAR FROM order_date)
    ORDER BY
        EXTRACT(YEAR FROM order_date)
		, EXTRACT(MONTH FROM order_date)
)
SELECT * FROM transformed

 * postgresql://ahmad:***@localhost:5432/northwind
23 rows affected.

[(Decimal('7'), Decimal('1996'), Decimal('2330.21')),
 (Decimal('8'), Decimal('1996'), Decimal('1124.13')),
 (Decimal('9'), Decimal('1996'), Decimal('772.60')),
 (Decimal('10'), Decimal('1996'), Decimal('3178.84')),
 (Decimal('11'), Decimal('1996'), Decimal('4103.96')),
 (Decimal('12'), Decimal('1996'), Decimal('5266.19')),
 (Decimal('1'), Decimal('1997'), Decimal('5127.61')),
 (Decimal('2'), Decimal('1997'), Decimal('2723.57')),
 (Decimal('3'), Decimal('1997'), Decimal('1432.68')),
 (Decimal('4'), Decimal('1997'), Decimal('2432.99')),
 (Decimal('5'), Decimal('1997'), Decimal('3042.41')),
 (Decimal('6'), Decimal('1997'), Decimal('2135.20')),
 (Decimal('7'), Decimal('1997'), Decimal('4444.07')),
 (Decimal('8'), Decimal('1997'), Decimal('2212.02')),
 (Decimal('9'), Decimal('1997'), Decimal('2722.13')),
 (Decimal('10'), Decimal('1997'), Decimal('3068.85')),
 (Decimal('11'), Decimal('1997'), Decimal('2379.55')),
 (Decimal('12'), Decimal('1997'), Decimal('6077.83')),
 (Decimal('1'), Decimal('1998'), Decimal('6632.61')),
 (Decimal('2'), Decimal('1998'), Decimal('3079.81')),
 (Decimal('3'), Decimal('1998'), Decimal('4746.48')),
 (Decimal('4'), Decimal('1998'), Decimal('10729.33')),
 (Decimal('5'), Decimal('1998'), Decimal('1565.03'))]

# yearly_sales_summary

In [6]:
%%sql
WITH orders AS (
    SELECT
        order_date,
        unit_price,
        quantity,
        discount,
        (unit_price * quantity * discount) AS total
    FROM
        "northwind"."dwh_facts"."fact_orders"
    WHERE shipped_date IS NOT NULL
)
,
transformed AS (
    SELECT
        EXTRACT(YEAR FROM order_date) as year,
        ROUND(SUM(total), 2) as total
    FROM
        orders
    GROUP BY
        EXTRACT(YEAR FROM order_date)
    ORDER BY
        EXTRACT(YEAR FROM order_date)
)
SELECT * FROM transformed

 * postgresql://ahmad:***@localhost:5432/northwind
3 rows affected.

[(Decimal('1996'), Decimal('16775.91')),
 (Decimal('1997'), Decimal('37798.90')),
 (Decimal('1998'), Decimal('26753.25'))]